Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}}@)
Gets the value options of an integer property.
IntOptions: The value options that were gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}})
Sets the value options of an integer property.
IntOptions: The new value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}}@)
Gets the value options of a double property.
DoubleOptions: The value options that were gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}})
Sets the value options of a double property.
DoubleOptions: The new value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}}@)
Gets the value options of a string property.
StringOptions: The value options that were gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})
Sets the value options of a string property.
StringOptions: The new value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetLabel
Gets the label of the user property.
Returns: The label of the user property.